#+TITLE: M2R Parallel System Project - First Analysis
#+AUTHOR: Christopher FERREIRA

The end goal of this statistical analysis is to show that the static "pinning" thread mapping strategy is
better than the thread mapping strategy implemented by Linux for two reasons :
  + Lower execution time
  + Lower variability

** Gather data

Our experimental framework gathers a lot of metrics during the execution of each experiment.
Here we only care about the execution time so we gather these execution time for each single experiment
into a csv file.

#+BEGIN_SRC sh
  export LANG=C

  datafile=time1.csv
  rm -f $datafile
  for exp in ../first_run/outputs/*; do
      pinning=$(echo $(basename $exp) | cut -d'-' -f2)
      threads=$(echo $(basename $exp) | cut -d'-' -f3)

      for iteration_dir in $exp/*; do
          iteration=$(basename $iteration_dir)
          time=$(tail -1 $iteration_dir/time)

          printf '%s,%d,%d,%f\n' \
                 $pinning $threads $iteration \
                 $time \
                 >>$datafile
      done
  done

  wc -l $datafile
#+END_SRC

#+RESULTS:
: 480 time1.csv

*** Setup

We first load the required libraries, loading the meta-package tidyverse
gets us everything (most notably dplyr and ggplot2).

#+BEGIN_SRC R :colnames no :results value verbatim
  library('tidyverse')

  'Ok !'
#+END_SRC

#+RESULTS:
: Ok !

Now we can load our data :
#+BEGIN_SRC R
  data <- read_csv('time1.csv',
          col_names = c('Pinning', 'Threads', 'Iteration', 'Time'))
  summary(data)
#+END_SRC

#+RESULTS:
| Pinning          | Threads    | Iteration    | Time           |
|------------------+------------+--------------+----------------|
| Length:480       | Min.   : 8 | Min.   : 1.0 | Min.   : 5.280 |
| Class :character | 1st Qu.:22 | 1st Qu.: 8.0 | 1st Qu.: 8.735 |
| Mode  :character | Median :36 | Median :15.5 | Median :14.305 |
| nil              | Mean   :36 | Mean   :15.5 | Mean   :18.636 |
| nil              | 3rd Qu.:50 | 3rd Qu.:23.0 | 3rd Qu.:23.095 |
| nil              | Max.   :64 | Max.   :30.0 | Max.   :58.710 |

** Gather data

Our experimental framework gathers a lot of metrics during the execution of each experiment.
Here we only care about the execution time so we gather these execution time for each single experiment
into a csv file.

#+BEGIN_SRC sh
  export LANG=C

  datafile=time2.csv
  rm -f $datafile
  for exp in ../first_run/outputs/* ../second_run/outputs/*; do
      pinning=$(echo $(basename $exp) | cut -d'-' -f2)
      threads=$(echo $(basename $exp) | cut -d'-' -f3)

      for iteration_dir in $exp/*; do
          iteration=$(basename $iteration_dir)
          time=$(tail -1 $iteration_dir/time)

          printf '%s,%d,%d,%f\n' \
                 $pinning $threads $iteration \
                 $time \
                 >>$datafile
      done
  done

  wc -l $datafile
#+END_SRC

#+RESULTS:
: 1280 time2.csv

*** Setup

We first load the required libraries, loading the meta-package tidyverse
gets us everything (most notably dplyr and ggplot2).

#+BEGIN_SRC R :colnames no :results value verbatim
  library('tidyverse')

  'Ok !'
#+END_SRC

#+RESULTS:
: Ok !

Now we can load our data :
#+BEGIN_SRC R
  data <- read_csv('time2.csv',
          col_names = c('Pinning', 'Threads', 'Iteration', 'Time'))
  summary(data)
#+END_SRC

#+RESULTS:
| Pinning          | Threads    | Iteration     | Time           |
|------------------+------------+---------------+----------------|
| Length:1280      | Min.   : 8 | Min.   : 1.00 | Min.   : 5.280 |
| Class :character | 1st Qu.:22 | 1st Qu.:10.75 | 1st Qu.: 8.727 |
| Mode  :character | Median :36 | Median :20.50 | Median :14.320 |
| nil              | Mean   :36 | Mean   :21.75 | Mean   :18.603 |
| nil              | 3rd Qu.:50 | 3rd Qu.:30.25 | 3rd Qu.:22.875 |
| nil              | Max.   :64 | Max.   :50.00 | Max.   :62.680 |

